-- 데이터 초기화 시 테이블 이름은 소문자로 해주세요
-- ex)mountain(O) Mountain(X)

INSERT INTO mountain(name, location)
values ('무등산', '광주'),
       ('북한산', '서울'),
       ('지리산', '전남'),
       ('설악산', '강원도'),
       ('한라산', '제주도'),
       ('덕유산', '전북'),
       ('태백산', '강원도'),
       ('오대산', '강원도'),
       ('소백산', '충북'),
       ('가야산', '경남'),
       ('월출산', '전남')
ON DUPLICATE KEY update name = VALUES(name);

-- 화장실 이름은 EXCEL 파일에 있는 지점명
-- 응급키트 이름은 EXCEL 파일에 있는 설치장소, 모름 데이터 제외하고 진행
-- ENUM(TOILET, MARKET, RENTAL, EMERGENCY_KIT)
INSERT INTO facility (mountain_id, name, type, latitude, longitude)
VALUES(1, '무등-1', 'TOILET', 35.122349, 126.971828),
      (1, '공용화장실', 'TOILET', 35.13255928, 126.96163878),
      (1, '버스회차지공중화장실', 'TOILET', 35.133972, 126.955497),
      (1, '증심사지구공원 주차장 화장실', 'TOILET', 35.1335241500643, 126.95101658998),
      (1, '아이더', 'MARKET', 35.13323974, 126.9570313),
      (1, '무등산사무소', 'RENTAL', 35.1314823638451, 126.948157767535),
      (1, '원효분소', 'RENTAL', 35.1623003853538, 126.980276058801),
      (1, '무등산 군왕봉 정상', 'EMERGENCY_KIT', 35.17214791, 126.9497182),
      (1, '무등산 장불재', 'EMERGENCY_KIT', 35.11612516, 126.9985684),
      (1, '무등산 중머리재', 'EMERGENCY_KIT', 35.11886432, 126.9843647),
      (1, '무등산 새인봉 삼거리', 'EMERGENCY_KIT', 35.1195428211767, 126.972851249219),
      (1, '무등산 토끼등', 'EMERGENCY_KIT', 35.13117145, 126.9779191),
      (1, '무등산 중봉', 'EMERGENCY_KIT', 35.12265985, 126.9927127),
      (1, '무등산 증심사 당산나무', 'EMERGENCY_KIT', 35.1256944736997, 126.972125113781),
      (1, '무등산 늦재삼거리', 'EMERGENCY_KIT', 35.143218, 126.9820064),
      (1, '인왕봉', 'EMERGENCY_KIT', 35.1239592, 127.0068104)
ON DUPLICATE KEY UPDATE name = VALUES(name);